app/views/authors/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]
---
<h2>Posts</h2>
<% @author.posts.each do |post| %>